# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'garethr/kubeval'
tap 'dtan4/dtan4'
tap 'farmotive/k8s'
tap 'caskroom/fonts'
tap 'txn2/tap'
tap 'wagoodman/dive'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
#brew 'homebrew/dupes/grep'

# Install Binaries
brew 'adr-tools'
brew 'antigen'
brew 'awscli'
brew 'fzf'
brew 'git'
brew 'go'
brew 'httpie'
brew 'hub'
brew 'graphviz'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'python2'
brew 'tig'
brew 'trash'
brew 'tree'
brew 'yarn'
brew 'wget'

# Development
brew 'packer'
brew 'terraform'
brew 'watch'

# docker utils
brew 'dive'
 
# k8s utils
brew 'kubectl'
brew 'kubectx'
brew 'kubefwd'
brew 'kube-ps1'
brew 'kubeval'
brew 'k8sec'
brew 'kpoof'
brew 'klog'
brew 'kex'
brew 'kud'
brew 'kubernetes-helm'

# Apps
cask 'caffeine'
cask 'docker-edge'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'firefox'
cask 'google-chrome'
cask 'intellij-idea'
cask 'insomnia'
cask 'iterm2'
cask 'java'
cask 'minikube'
cask 'shuttle'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack-nerd-font'

# Install Mac App Store apps
#mas '1Password', id: 443987910
#mas 'Byword', id: 420212497
#mas 'Deckset', id: 847496013
#mas 'Gapplin', id: 768053424
#mas 'Giphy Capture', id: 668208984
#mas 'Paw', id: 584653203
#mas 'Sip', id: 507257563
#mas 'Sketch', id: 402476602
#mas 'Spark', id: 1176895641
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 557168941
#mas 'Unsplash Wallpapers', id: 1284863847
